; domain
(define (domain eldoria-quest)
  (:requirements :strips :typing :negative-preconditions)
  (:types character item location flora spirit)

  (:constants
    healing_herb map_of_eldoria - item
    cursed_plant - flora
    grove_entrance grove_interior village - location
  )

  (:predicates
    (at ?c - character ?l - location)
    (has ?c - character ?i - item)
    (connected ?from - location ?to - location)
    (grove_is_cursed)
    (grove_is_restored)
    (plant_is_hostile ?f - flora)
    (plant_is_pacified ?f - flora)
    (is_prepared)
    (has_foraged)
    (knows_curse_source)
  )

  (:action move
    :parameters (?c - character ?from - location ?to - location)
    :precondition (and
      (at ?c ?from)
      (connected ?from ?to)
    )
    :effect (and
      (not (at ?c ?from))
      (at ?c ?to)
    )
  )

  (:action prepare_at_village
    :parameters (?c - character)
    :precondition (and
      (at ?c village)
      (not (is_prepared))
    )
    :effect (and
      (is_prepared)
    )
  )

  (:action pacify_hostile_plant
    :parameters (?c - character ?f - flora)
    :precondition (and
      (at ?c grove_interior)
      (has ?c healing_herb)
      (plant_is_hostile ?f)
    )
    :effect (and
      (not (plant_is_hostile ?f))
      (plant_is_pacified ?f)
      (not (has ?c healing_herb))
    )
  )

  (:action confront_nox
    :parameters (?c - character ?s - spirit)
    :precondition (and
      (at ?c grove_interior)
      (plant_is_pacified cursed_plant)
      (not (knows_curse_source))
    )
    :effect (and
      (knows_curse_source)
    )
  )

  (:action resolve_curse
    :parameters (?c - character)
    :precondition (and
      (at ?c grove_interior)
      (knows_curse_source)
      (grove_is_cursed)
    )
    :effect (and
      (not (grove_is_cursed))
      (grove_is_restored)
    )
  )

  (:action forage_in_grove
    :parameters (?c - character)
    :precondition (and
      (at ?c grove_interior)
      (grove_is_restored)
    )
    :effect (and
      (has_foraged)
    )
  )
)

; problem
(define (problem restore-the-enchanted-grove)
  (:domain eldoria-quest)
  (:objects
    elara - character
    nox - spirit
  )

  (:init
    (at elara grove_entrance)
    (has elara healing_herb)
    (has elara map_of_eldoria)
    (grove_is_cursed)
    (plant_is_hostile cursed_plant)

    (connected grove_entrance grove_interior)
    (connected grove_interior grove_entrance)
    (connected grove_entrance village)
    (connected village grove_entrance)
    (connected grove_interior village)
    (connected village grove_interior)
  )

  (:goal (and
    (at elara village)
    (grove_is_restored)
  ))
)

; plan
1. (move elara grove_entrance grove_interior)
   deleted: (at elara grove_entrance)
   added: (at elara grove_interior)
   goals met: 0 of 2
2. (pacify_hostile_plant elara cursed_plant)
   deleted: (plant_is_hostile cursed_plant) (has elara healing_herb)
   added: (plant_is_pacified cursed_plant)
   goals met: 0 of 2
3. (confront_nox elara nox)
   added: (knows_curse_source)
   goals met: 0 of 2
4. (resolve_curse elara)
   deleted: (grove_is_cursed)
   added: (grove_is_restored)
   goals met: 1 of 2
5. (move elara grove_interior village)
   deleted: (at elara grove_interior)
   added: (at elara village)
   goals met: 2 of 2
